; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-5-4-8-8-3) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor3)
	(clear pallet6)
	(at pallet7 distributor4)
	(clear pallet7)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at truck2 distributor0)
	(at truck3 distributor4)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor3)
	(available hoist6)
	(at hoist7 distributor4)
	(available hoist7)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(at crate1 distributor1)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet0)
)

(:goal (and
		(on crate0 pallet6)
		(on crate1 pallet3)
	)
))

; plan
1. (lift hoist4 crate1 crate0 distributor1)
   deleted: (at crate1 distributor1) (available hoist4) (on crate1 crate0) (clear crate1)
   added: (lifting hoist4 crate1) (clear crate0)
   goals met: 0 of 2
2. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 2
3. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   goals met: 0 of 2
4. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (available hoist4) (on crate0 pallet4) (clear crate0)
   added: (lifting hoist4 crate0) (clear pallet4)
   goals met: 0 of 2
5. (load hoist4 crate0 truck0 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck0) (available hoist4)
   goals met: 0 of 2
6. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 2
7. (unload hoist3 crate1 truck0 distributor0)
   deleted: (available hoist3) (in crate1 truck0)
   added: (lifting hoist3 crate1)
   goals met: 0 of 2
8. (drop hoist3 crate1 pallet3 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (at crate1 distributor0) (available hoist3) (on crate1 pallet3) (clear crate1)
   goals met: 1 of 2
9. (drive truck0 distributor0 distributor3)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor3)
   goals met: 1 of 2
10. (unload hoist6 crate0 truck0 distributor3)
   deleted: (available hoist6) (in crate0 truck0)
   added: (lifting hoist6 crate0)
   goals met: 1 of 2
11. (drop hoist6 crate0 pallet6 distributor3)
   deleted: (lifting hoist6 crate0) (clear pallet6)
   added: (at crate0 distributor3) (available hoist6) (on crate0 pallet6) (clear crate0)
   goals met: 2 of 2
